bolknote/MK61S_MINI/code/config.h
#ifndef CONFIG
#define CONFIG

#include "Arduino.h"
#include "rust_types.h"

//#define DEBUG_CORE61        // Полная отладочная информация по ядру mk61s (почти не слушает клавиатуру)
//#define DEBUG_TRACE         // Отладочная трассировочная информация по значению
//#define DEBUG_MINI          // Отладочная информация по оболочке MK61S-MINI
//#define DEBUG_SPIFLASH      // Отладочная информация по обработке внешней флеш памяти
//#define DEBUG_DISASMBLER    // Отладочная информация по встроенному дисассемблеру МК61 инструкций
//#define DEBUG_KBD           // Отладочная информация по клавиатурному драйверу
//#define DEBUG_MENU          // Отладочная информация по системе меню
//#define DEBUG_LIBRARY       // Отладочная информация по библиотеке программ МК61
//#define DEBUG_MK61E         // Отладочная информация расширяющая представление вывода терминала по МК61
//#define DEBUG_PARSE         // Отладочная информация по парсеру ассемблера
// Расширение памяти программы 105/112 теперь переключается из меню.
//#define DEBUG_MEASURE       // Вывод времени исполнения от С/П до С/П для вычисления производительности ядра
//#define DEBUG_RUN_STOP      // Отладочный вывод по расширению команды С/П
//#define MK61_EXTENDED
//#define B3_34
#define TERMINAL
#define SPI_FLASH
//#define DEBUG
//#define DEBUG_M61

// DWT CYCCNT-профилировщик не собирает данные до команды `prof start`.
// Значение 0 полностью удаляет точки измерения и терминальную команду.
#ifndef MK61_ENABLE_DWT_PROFILER
  #define MK61_ENABLE_DWT_PROFILER 1
#endif
#if MK61_ENABLE_DWT_PROFILER != 0 && MK61_ENABLE_DWT_PROFILER != 1
  #error "MK61_ENABLE_DWT_PROFILER must be 0 or 1"
#endif

// Аппаратные faults сохраняют компактную запись в .noinit и перезагружают
// MCU. Преднамеренные faults никогда не входят в release по умолчанию и
// включаются отдельным флагом только для стендовой проверки.
#ifndef MK61_ENABLE_CRASH_DUMP
  #define MK61_ENABLE_CRASH_DUMP 1
#endif
#if MK61_ENABLE_CRASH_DUMP != 0 && MK61_ENABLE_CRASH_DUMP != 1
  #error "MK61_ENABLE_CRASH_DUMP must be 0 or 1"
#endif

// Release builders set this to 1 and seal the resident BIN after linking.
// Generic Arduino development builds remain bootable but report "unsealed";
// they must never be labelled as CRC-verified release artifacts.
#ifndef MK61_REQUIRE_RESIDENT_CRC
  #define MK61_REQUIRE_RESIDENT_CRC 0
#endif
#if MK61_REQUIRE_RESIDENT_CRC != 0 && MK61_REQUIRE_RESIDENT_CRC != 1
  #error "MK61_REQUIRE_RESIDENT_CRC must be 0 or 1"
#endif
#ifndef MK61_ENABLE_FAULT_INJECTION
  #define MK61_ENABLE_FAULT_INJECTION 0
#endif
#if MK61_ENABLE_FAULT_INJECTION != 0 && MK61_ENABLE_FAULT_INJECTION != 1
  #error "MK61_ENABLE_FAULT_INJECTION must be 0 or 1"
#endif

// Cortex-M4 MPU guards catch null access, stack/heap collision and (where no
// System APP executes from SRAM) accidental code execution from data memory.
#ifndef MK61_ENABLE_MPU_GUARDS
  #define MK61_ENABLE_MPU_GUARDS 1
#endif
#if MK61_ENABLE_MPU_GUARDS != 0 && MK61_ENABLE_MPU_GUARDS != 1
  #error "MK61_ENABLE_MPU_GUARDS must be 0 or 1"
#endif
#ifndef MK61_ENABLE_MPU_TEST
  #define MK61_ENABLE_MPU_TEST 0
#endif
#if MK61_ENABLE_MPU_TEST != 0 && MK61_ENABLE_MPU_TEST != 1
  #error "MK61_ENABLE_MPU_TEST must be 0 or 1"
#endif

// IWDG стартует только в конце setup и кормится после завершённого foreground
// service epoch. Стендовые starvation/hang действия отсутствуют в release.
#ifndef MK61_ENABLE_INDEPENDENT_WATCHDOG
  #define MK61_ENABLE_INDEPENDENT_WATCHDOG 1
#endif
#if MK61_ENABLE_INDEPENDENT_WATCHDOG != 0 && \
    MK61_ENABLE_INDEPENDENT_WATCHDOG != 1
  #error "MK61_ENABLE_INDEPENDENT_WATCHDOG must be 0 or 1"
#endif
#ifndef MK61_ENABLE_WATCHDOG_TEST
  #define MK61_ENABLE_WATCHDOG_TEST 0
#endif
#if MK61_ENABLE_WATCHDOG_TEST != 0 && MK61_ENABLE_WATCHDOG_TEST != 1
  #error "MK61_ENABLE_WATCHDOG_TEST must be 0 or 1"
#endif

// Shallow Cortex-M Sleep is the conservative fallback whenever the qualified
// profile below cannot enter STOP. SysTick remains its periodic wake source.
#ifndef MK61_ENABLE_IDLE_WFI
  #define MK61_ENABLE_IDLE_WFI 1
#endif
#if MK61_ENABLE_IDLE_WFI != 0 && MK61_ENABLE_IDLE_WFI != 1
  #error "MK61_ENABLE_IDLE_WFI must be 0 or 1"
#endif

// Observe the STM32 USB device state through linker wrappers.  This exposes
// exact reset/setup/suspend/resume telemetry but does not alter descriptors or
// power behaviour in a normal release.
#ifndef MK61_ENABLE_USB_POWER_OBSERVER
  #define MK61_ENABLE_USB_POWER_OBSERVER 1
#endif
#if MK61_ENABLE_USB_POWER_OBSERVER != 0 && \
    MK61_ENABLE_USB_POWER_OBSERVER != 1
  #error "MK61_ENABLE_USB_POWER_OBSERVER must be 0 or 1"
#endif

// PVD (programmable voltage detector) blocks the start of new NOR program /
// erase commands and USB MSC writes before VDD reaches the W25Q128 minimum.
// Level 6 is the conservative common F401/F411 threshold: falling edge
// 2.85..2.99 V, rising edge 2.96..3.10 V.  The fitted W25Q128JV is specified
// down to 2.7 V; a 100 ms stable interval prevents write-enable chatter.
#ifndef MK61_ENABLE_PVD
  #define MK61_ENABLE_PVD 1
#endif
#if MK61_ENABLE_PVD != 0 && MK61_ENABLE_PVD != 1
  #error "MK61_ENABLE_PVD must be 0 or 1"
#endif
#ifndef MK61_PVD_LEVEL
  #define MK61_PVD_LEVEL 6
#endif
#if MK61_PVD_LEVEL < 0 || MK61_PVD_LEVEL > 7
  #error "MK61_PVD_LEVEL must be in the range 0..7"
#endif
#ifndef MK61_PVD_RECOVERY_STABLE_MS
  #define MK61_PVD_RECOVERY_STABLE_MS 100UL
#endif
#if MK61_PVD_RECOVERY_STABLE_MS < 10UL || \
    MK61_PVD_RECOVERY_STABLE_MS > 5000UL
  #error "MK61_PVD_RECOVERY_STABLE_MS must be 10..5000"
#endif

// Старый резервный вариант хранения через EEPROM Arduino требует 8-КиБ буфер
// ОЗУ на STM32F4. Штатная конфигурация A00 хранит программы и настройки
// во внешней SPI-флеш-памяти.
#ifndef MK61_USE_ARDUINO_EEPROM_FALLBACK
  #define MK61_USE_ARDUINO_EEPROM_FALLBACK 0
#endif

// Дисплей: по умолчанию старый LCD1602. Для готовой платы Classic выбирайте
// полный профиль MK61_BOARD_CLASSIC_V2 или MK61_BOARD_CLASSIC_V3 ниже.
// Один MK61_DISPLAY_UC1609 сохранён как совместимый способ выбрать Classic V2.
//#define MK61_DISPLAY_UC1609
// Символьный дисплей: по умолчанию LCD1602 с японской A00. Для европейской
// A02 включить MK61_LCD1602_A02, для OLED WEH001602A/WS0010 —
// MK61_OLED1602_WS0010. Контроллер WS0010 выбирает English/Russian FT=10.
//#define MK61_LCD1602_A02
//#define MK61_OLED1602_WS0010

