bolknote/MK61S_MINI/code/config.h
#define MK61_FOCAL_IS_BUILTIN \
  (MK61_ENABLE_FOCAL && !MK61_ENABLE_LOADABLE_MODULES)
#define MK61_TINYBASIC_IS_BUILTIN \
  (MK61_ENABLE_TINYBASIC && !MK61_ENABLE_LOADABLE_MODULES)
#define MK61_WBMP_VIEWER_IS_BUILTIN \
  (MK61_STANDALONE_WBMP_VIEWER_ENABLED && \
   !MK61_ENABLE_LOADABLE_MODULES)
#define MK61_MARKDOWN_VIEWER_IS_BUILTIN \
  (MK61_ENABLE_MARKDOWN_VIEWER && !MK61_ENABLE_LOADABLE_MODULES)
#define MK61_CHIP8_IS_BUILTIN \
  (MK61_ENABLE_CHIP8 && !MK61_ENABLE_LOADABLE_MODULES)

// Графический Markdown владеет полным I1-viewer и WBMP-декодером: он показывает
// как локальные блоки изображений, так и самостоятельные .wbmp. Это правило
// одинаково для UC1609, USB Screen и квалификационной GDRAM WS0010 100x16.
#define MK61_IMAGE1_VIEWER_IS_BUILTIN \
  (MK61_WBMP_VIEWER_IS_BUILTIN || \
   (MK61_MARKDOWN_VIEWER_IS_BUILTIN && MK61_MARKDOWN_USES_WBMP))
#define MK61_WBMP_DECODER_IS_BUILTIN \
  (MK61_IMAGE1_VIEWER_IS_BUILTIN)

#define MK61_ANY_FULLSCREEN_FILE \
  (MK61_STANDALONE_WBMP_VIEWER_ENABLED || MK61_ENABLE_CHIP8 || \
   MK61_MARKDOWN_USES_WBMP)

// Расширенная ручная настройка строк, высоты, ширины и межстрочного интервала
// графического шрифта. По умолчанию в меню остается только выбор пресета шрифта.
#ifndef MK61_ENABLE_EXTENDED_FONT_SETTINGS
  #define MK61_ENABLE_EXTENDED_FONT_SETTINGS 0
#endif

// Математический бэкенд языков (FOCAL/TinyBASIC).
//  LIBM (умолчание) — трансцендентные функции через <math.h>.
//  CORE             — вычисление на ядре МК-61; убирает libm из прошивки
//                     ценой ~8 значащих цифр и меньшей скорости.
#define MK61_MATH_BACKEND_LIBM 0
#define MK61_MATH_BACKEND_CORE 1
#ifndef MK61_MATH_BACKEND
  #define MK61_MATH_BACKEND MK61_MATH_BACKEND_LIBM
#endif

// Короткое нажатие [USER] открывает Проводник. Поставьте 0, чтобы оставить
// [USER] только для удержания стека и функций режима ПРГ.
#ifndef MK61_USER_EXPLORER_SHORTCUT
  #define MK61_USER_EXPLORER_SHORTCUT 1
#endif

#if defined(DISPLAY_UC1609) && !defined(MK61_DISPLAY_UC1609)
  #define MK61_DISPLAY_UC1609
#endif

#if defined(DISPLAY_LCD1602) && !defined(MK61_DISPLAY_LCD1602)
  #define MK61_DISPLAY_LCD1602
#endif

// Полные профили плат с UC1609. Classic V2 и V3 используют одинаковые дисплей
// и клавиатуру, но отличаются выводом буззера и полярностью LED.
//#define MK61_BOARD_CLASSIC_V2
//#define MK61_BOARD_CLASSIC_V3
//#define MK61_BOARD_40TH

#if (defined(MK61_BOARD_CLASSIC_V2) + defined(MK61_BOARD_CLASSIC_V3) + defined(MK61_BOARD_40TH)) > 1
  #error "Select only one UC1609 board profile"
#endif

#if defined(MK61_BOARD_CLASSIC_V2) || defined(MK61_BOARD_CLASSIC_V3)
  #if !defined(MK61_DISPLAY_UC1609)
    #define MK61_DISPLAY_UC1609
  #endif
  #if !defined(MK61_KEYBOARD_CLASSIC)
    #define MK61_KEYBOARD_CLASSIC
  #endif
#endif

// Профиль 40TH включает UC1609 и отдельную раскладку старой 40-клавишной версии.
#if defined(MK61_BOARD_40TH)
  #if !defined(MK61_DISPLAY_UC1609)
    #define MK61_DISPLAY_UC1609
  #endif
  #if !defined(MK61_KEYBOARD_40TH)
    #define MK61_KEYBOARD_40TH
  #endif
#endif

#if !defined(MK61_DISPLAY_UC1609)
  #define MK61_DISPLAY_LCD1602
#endif

// Read benchmarks are service diagnostics, not calculator functionality.
// Keep them on normal builds and on the F411 qualification board, but do not
// spend the last internal-Flash reserve of the F401/UC1609 release on a command
// that is used only while characterising storage performance.  An explicit
// build flag always wins, so a laboratory F401 image can still enable it.
#ifndef MK61_ENABLE_READ_BENCHMARKS
  #if defined(ARDUINO_BLACKPILL_F401CC) && defined(MK61_DISPLAY_UC1609)
    #define MK61_ENABLE_READ_BENCHMARKS 0
  #else
    #define MK61_ENABLE_READ_BENCHMARKS 1
  #endif
#endif
#if MK61_ENABLE_READ_BENCHMARKS != 0 && MK61_ENABLE_READ_BENCHMARKS != 1
  #error "MK61_ENABLE_READ_BENCHMARKS must be 0 or 1"
#endif

// Raw ADC fields are a service report; the user-facing Hardware menu keeps
// VDD/MCU temperature/honest battery state on every target.  The constrained
// F401/UC1609 release omits only this duplicate terminal rendering to retain
// the mandatory sealed-Flash reserve.  Laboratory builds may override it.
#ifndef MK61_ENABLE_ANALOG_REPORT
  #if defined(ARDUINO_BLACKPILL_F401CC) && defined(MK61_DISPLAY_UC1609)
    #define MK61_ENABLE_ANALOG_REPORT 0
  #else
    #define MK61_ENABLE_ANALOG_REPORT 1
  #endif
#endif
#if MK61_ENABLE_ANALOG_REPORT != 0 && MK61_ENABLE_ANALOG_REPORT != 1
  #error "MK61_ENABLE_ANALOG_REPORT must be 0 or 1"
#endif

// Alarm scheduling is user-visible functionality, not a laboratory report.
// Keep the same command/API on F401 and F411; the constrained F401 release is
// built with size-LTO and retains its sealed-image reserve that way.
#ifndef MK61_ENABLE_RTC_ALARM_TERMINAL
  #define MK61_ENABLE_RTC_ALARM_TERMINAL 1
#endif
#if MK61_ENABLE_RTC_ALARM_TERMINAL != 0 && \
    MK61_ENABLE_RTC_ALARM_TERMINAL != 1
  #error "MK61_ENABLE_RTC_ALARM_TERMINAL must be 0 or 1"
#endif

#if defined(DISPLAY_LCD1602_A00) && !defined(MK61_LCD1602_A00)
  #define MK61_LCD1602_A00
#endif

#if defined(DISPLAY_LCD1602_A02) && !defined(MK61_LCD1602_A02)
  #define MK61_LCD1602_A02
#endif

#if defined(DISPLAY_OLED1602_WS0010) && !defined(MK61_OLED1602_WS0010)
  #define MK61_OLED1602_WS0010
#endif

#if (defined(MK61_LCD1602_A00) + defined(MK61_LCD1602_A02) + \
     defined(MK61_OLED1602_WS0010)) > 1
  #error "Select only one character-display controller/CGROM profile"
#endif

#if defined(MK61_OLED1602_WS0010) && !defined(MK61_DISPLAY_LCD1602)
  #error "MK61_OLED1602_WS0010 requires the 16x2 character-display backend"
#endif

#if defined(MK61_DISPLAY_LCD1602) && !defined(MK61_LCD1602_A00) && \
    !defined(MK61_LCD1602_A02) && !defined(MK61_OLED1602_WS0010)
  #define MK61_LCD1602_A00
#endif

// На mini V2/V3 линия RW подключена к PB1. У mini V3 все четыре линии данных
// (PB10/PA3/PA2/PA1) являются FT GPIO у STM32F401CC и STM32F411CE, поэтому
// после инициализации можно завершать каждый 4-битный обмен обязательным для
// WS0010 двухполубайтным чтением BF/AC. Остальные профили сохраняют прежнюю
// политику: обычный HD44780 mini читает DB7, а платы без RW только пишут.
#ifndef MK61_LCD1602_BUSY_FLAG
  #if defined(MK61_DISPLAY_LCD1602) && !defined(CDU) && !defined(LK432) && \
      (!defined(MK61_OLED1602_WS0010) || defined(REVISION_V3))
    #define MK61_LCD1602_BUSY_FLAG 1
  #else
    #define MK61_LCD1602_BUSY_FLAG 0
  #endif
#endif

#if MK61_LCD1602_BUSY_FLAG && (!defined(MK61_DISPLAY_LCD1602) || defined(CDU) || defined(LK432))
  #error "MK61_LCD1602_BUSY_FLAG requires a mini V2/V3 LCD1602 profile with RW"
#endif

#if defined(MK61_OLED1602_WS0010) && MK61_LCD1602_BUSY_FLAG && \
    !defined(REVISION_V3)
  #error "WS0010 busy-flag reads are qualified only on mini V3 FT data pins"
#endif
#if defined(MK61_OLED1602_WS0010) && defined(REVISION_V3) && \
    !MK61_LCD1602_BUSY_FLAG
  #error "mini V3 WS0010 requires the datasheet busy-flag read after every byte"
#endif

// The module can route analogue brightness to connector pin 3 after a
// revision-specific solder-jumper modification, but mini V3 connects that pin
// only to its manual potentiometer, not to an MCU GPIO. No software
// brightness/current command is enabled without an official, qualified
// controller command. Display-off OLED protection remains independent.
#ifndef MK61_WS0010_BRIGHTNESS_CONTROL
  #define MK61_WS0010_BRIGHTNESS_CONTROL 0
#endif
#if MK61_WS0010_BRIGHTNESS_CONTROL != 0 && MK61_WS0010_BRIGHTNESS_CONTROL != 1
  #error "MK61_WS0010_BRIGHTNESS_CONTROL must be 0 or 1"
#endif
#if MK61_WS0010_BRIGHTNESS_CONTROL
  #error "WS0010 brightness control is not qualified for WEH001602A"
#endif

// Клавиатура: у classic-платформы с UC1609 другая физическая матрица и коды.
// Если вариант не задан явно, LCD1602 остается mk61s-mini, UC1609 выбирает classic.
#if defined(MK61_DISPLAY_UC1609) && !defined(MK61_KEYBOARD_MINI) && !defined(MK61_KEYBOARD_CLASSIC) && !defined(MK61_KEYBOARD_40TH)
  #define MK61_KEYBOARD_CLASSIC
#endif

#if !defined(MK61_KEYBOARD_CLASSIC) && !defined(MK61_KEYBOARD_MINI) && !defined(MK61_KEYBOARD_40TH)
  #define MK61_KEYBOARD_MINI
#endif

#if (defined(MK61_KEYBOARD_CLASSIC) + defined(MK61_KEYBOARD_MINI) + defined(MK61_KEYBOARD_40TH)) > 1
  #error "Select only one keyboard layout"
#endif

// Обратная совместимость: прежние флаги UC1609 + classic-клавиатура означают
// Classic V2. Новые сборки должны задавать полный профиль явно.
#if defined(MK61_DISPLAY_UC1609) && defined(MK61_KEYBOARD_CLASSIC) && \
    !defined(MK61_BOARD_CLASSIC_V2) && !defined(MK61_BOARD_CLASSIC_V3)
  #define MK61_BOARD_CLASSIC_V2
#endif

