bolknote/MK61S_MINI/code/config.h
// REVISION_V2 относится только к параллельному LCD платы mini V2 и не является
// ревизией Classic. Такая комбинация дала бы неверную распиновку буззера.
#if defined(REVISION_V2) && (defined(MK61_BOARD_CLASSIC_V2) || defined(MK61_BOARD_CLASSIC_V3) || defined(MK61_BOARD_40TH))
  #error "REVISION_V2 cannot be combined with a UC1609 board profile"
#endif

// Production STOP is enabled only on exact F411 hardware combinations that
// passed physical display, keyboard, RTC and FNB58 qualification. Mini V3
// WS0010 and Classic V3 UC1609 use different display sleep commands but share
// the proven STOP/clock/USB core. F401, A00/A02, Classic V2 and 40th retain
// shallow WFI.
#if defined(STM32F411xE) && defined(REVISION_V3) && \
    ((defined(MK61_KEYBOARD_MINI) && defined(MK61_OLED1602_WS0010)) || \
     (defined(MK61_BOARD_CLASSIC_V3) && \
      defined(MK61_KEYBOARD_CLASSIC) && defined(MK61_DISPLAY_UC1609)))
  #define MK61_DEEP_IDLE_PRODUCTION_PROFILE 1
#else
  #define MK61_DEEP_IDLE_PRODUCTION_PROFILE 0
#endif
#ifndef MK61_ENABLE_DEEP_IDLE
  #if MK61_DEEP_IDLE_PRODUCTION_PROFILE
    #define MK61_ENABLE_DEEP_IDLE 1
  #else
    #define MK61_ENABLE_DEEP_IDLE 0
  #endif
#endif
#if MK61_ENABLE_DEEP_IDLE != 0 && MK61_ENABLE_DEEP_IDLE != 1
  #error "MK61_ENABLE_DEEP_IDLE must be 0 or 1"
#endif
#if MK61_ENABLE_DEEP_IDLE && !MK61_DEEP_IDLE_PRODUCTION_PROFILE
  #error "production deep idle is qualified only for exact F411 WS0010/Classic-V3-UC1609 profiles"
#endif

// Backward-compatible laboratory override for bounded STOP experiments on
// otherwise unsupported profiles. It never changes the production default.
#ifndef MK61_ENABLE_DEEP_IDLE_QUALIFICATION
  #define MK61_ENABLE_DEEP_IDLE_QUALIFICATION 0
#endif
#if MK61_ENABLE_DEEP_IDLE_QUALIFICATION != 0 && \
    MK61_ENABLE_DEEP_IDLE_QUALIFICATION != 1
  #error "MK61_ENABLE_DEEP_IDLE_QUALIFICATION must be 0 or 1"
#endif
#define MK61_DEEP_IDLE_ENABLED \
  (MK61_ENABLE_DEEP_IDLE || MK61_ENABLE_DEEP_IDLE_QUALIFICATION)

// A suspended USB connection is preserved across STOP. No Remote Wake bit is
// advertised and no resume signal is sent: a key wakes only the calculator;
// the host remains asleep until it wakes for an independent reason.
#ifndef MK61_ENABLE_USB_SUSPEND
  #define MK61_ENABLE_USB_SUSPEND MK61_ENABLE_DEEP_IDLE
#endif
#if MK61_ENABLE_USB_SUSPEND != 0 && MK61_ENABLE_USB_SUSPEND != 1
  #error "MK61_ENABLE_USB_SUSPEND must be 0 or 1"
#endif
#ifndef MK61_ENABLE_USB_SUSPEND_QUALIFICATION
  #define MK61_ENABLE_USB_SUSPEND_QUALIFICATION 0
#endif
#if MK61_ENABLE_USB_SUSPEND_QUALIFICATION != 0 && \
    MK61_ENABLE_USB_SUSPEND_QUALIFICATION != 1
  #error "MK61_ENABLE_USB_SUSPEND_QUALIFICATION must be 0 or 1"
#endif
#define MK61_USB_SUSPEND_ENABLED \
  (MK61_ENABLE_USB_SUSPEND || MK61_ENABLE_USB_SUSPEND_QUALIFICATION)
#if MK61_USB_SUSPEND_ENABLED && !MK61_DEEP_IDLE_ENABLED
  #error "USB suspend preservation requires deep idle"
#endif
#if MK61_USB_SUSPEND_ENABLED && !MK61_ENABLE_USB_POWER_OBSERVER
  #error "USB suspend preservation requires the USB power observer"
#endif

// Once the host suspends USB, production firmware enters repeated bounded
// five-second STOP cycles automatically. The same state machine is also used
// by the explicit `prof deep` diagnostic command.
#ifndef MK61_ENABLE_USB_AUTO_DEEP_IDLE
  #define MK61_ENABLE_USB_AUTO_DEEP_IDLE MK61_ENABLE_USB_SUSPEND
#endif
#if MK61_ENABLE_USB_AUTO_DEEP_IDLE != 0 && \
    MK61_ENABLE_USB_AUTO_DEEP_IDLE != 1
  #error "MK61_ENABLE_USB_AUTO_DEEP_IDLE must be 0 or 1"
#endif
#ifndef MK61_ENABLE_USB_AUTO_DEEP_IDLE_QUALIFICATION
  #define MK61_ENABLE_USB_AUTO_DEEP_IDLE_QUALIFICATION 0
#endif
#if MK61_ENABLE_USB_AUTO_DEEP_IDLE_QUALIFICATION != 0 && \
    MK61_ENABLE_USB_AUTO_DEEP_IDLE_QUALIFICATION != 1
  #error "MK61_ENABLE_USB_AUTO_DEEP_IDLE_QUALIFICATION must be 0 or 1"
#endif
#define MK61_USB_AUTO_DEEP_IDLE_ENABLED \
  (MK61_ENABLE_USB_AUTO_DEEP_IDLE || \
   MK61_ENABLE_USB_AUTO_DEEP_IDLE_QUALIFICATION)
#if MK61_USB_AUTO_DEEP_IDLE_ENABLED && !MK61_USB_SUSPEND_ENABLED
  #error "automatic USB deep idle requires USB suspend preservation"
#endif

// Mini/LCD1602 has only the NOR client on SPI1, so its measured arbiter and DMA
// backend are enabled by default. UC1609 shares SPI1 with NOR and is enabled
// only on the exact F411 Classic V3 profile qualified on physical hardware;
// F401, Classic V2 and 40th retain the original polling path until their own
// hardware acceptance. Explicit laboratory overrides still take precedence.
#ifndef MK61_ENABLE_SPI1_ARBITER
  #if !defined(MK61_DISPLAY_UC1609) || \
      (defined(STM32F411xE) && defined(MK61_BOARD_CLASSIC_V3))
    #define MK61_ENABLE_SPI1_ARBITER 1
  #else
    #define MK61_ENABLE_SPI1_ARBITER 0
  #endif
#endif
#if MK61_ENABLE_SPI1_ARBITER != 0 && MK61_ENABLE_SPI1_ARBITER != 1
  #error "MK61_ENABLE_SPI1_ARBITER must be 0 or 1"
#endif

// Long SPI1 buffers can use DMA2 S2/S3 after the polling arbiter has granted
// exclusive ownership. The measured threshold is deliberately configurable;
// short command/address transfers remain on the cheaper polling path.
#ifndef MK61_ENABLE_SPI1_DMA
  #define MK61_ENABLE_SPI1_DMA MK61_ENABLE_SPI1_ARBITER
#endif
#if MK61_ENABLE_SPI1_DMA != 0 && MK61_ENABLE_SPI1_DMA != 1
  #error "MK61_ENABLE_SPI1_DMA must be 0 or 1"
#endif
#if MK61_ENABLE_SPI1_DMA && !MK61_ENABLE_SPI1_ARBITER
  #error "MK61_ENABLE_SPI1_DMA requires MK61_ENABLE_SPI1_ARBITER=1"
#endif
#ifndef MK61_SPI1_DMA_THRESHOLD
  // HIL A/B on F411/W25Q128: 64-byte transfers amortize DMA setup and reduce
  // latency for small C5 records; shorter command/address traffic stays polling.
  #define MK61_SPI1_DMA_THRESHOLD 64
#endif
#if MK61_SPI1_DMA_THRESHOLD < 1 || MK61_SPI1_DMA_THRESHOLD > 65535
  #error "MK61_SPI1_DMA_THRESHOLD must be in 1..65535"
#endif

// Small C5 records and ZX0 input are consumed incrementally. 512 bytes won the
// 64/128/256/512 HIL matrix and remains a stack-local buffer, so static RAM is
// unchanged. Keep the compile-time tuning point for repeatable qualification.
#ifndef MK61_PROGRAM_STORE_READ_CHUNK
  #define MK61_PROGRAM_STORE_READ_CHUNK 512
#endif
#if MK61_PROGRAM_STORE_READ_CHUNK < 32 || MK61_PROGRAM_STORE_READ_CHUNK > 512
  #error "MK61_PROGRAM_STORE_READ_CHUNK must be in 32..512"
#endif
// Электрическая полярность PC13 задаётся полной платой, а не типом клавиатуры:
// mini V2/V3 и Classic V3 — active HIGH; Classic V2 и 40th — active LOW.
// Храним полярность в профиле платы, чтобы все вызовы led::on/off/blink
// использовали один и тот же аппаратно правильный уровень.
#if defined(MK61_BOARD_CLASSIC_V2) || defined(MK61_BOARD_40TH)
  static constexpr u8 MK61_STATUS_LED_ACTIVE_LOW = 1;
#else
  static constexpr u8 MK61_STATUS_LED_ACTIVE_LOW = 0;
#endif

